ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/flctl.xml
<module id="FLCTL" HW_revision=""><register id="POWER_STAT" width="32" offset="0x0" internal="0" description="Power Status Register"><bitfield id="PSTAT" description="Flash power status" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="PSTAT__0" value="0x0" description="Flash IP in power-down mode"/><bitenum id="PSTAT__1" value="0x1" description="Flash IP Vdd domain power-up in progress"/><bitenum id="PSTAT__2" value="0x2" description="PSS LDO_GOOD, IREF_OK and VREF_OK check in progress"/><bitenum id="PSTAT__3" value="0x3" description="Flash IP SAFE_LV check in progress"/><bitenum id="PSTAT__4" value="0x4" description="Flash IP Active"/><bitenum id="PSTAT__5" value="0x5" description="Flash IP Active in Low-Frequency Active and Low-Frequency LPM0 "/><bitenum id="PSTAT__6" value="0x6" description="Flash IP in Standby mode"/><bitenum id="PSTAT__7" value="0x7" description="Flash IP in Current mirror boost state"/></bitfield><bitfield id="LDOSTAT" description="PSS FLDO GOOD status" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="LDOSTAT__0" value="0x0" description="FLDO not GOOD"/><bitenum id="LDOSTAT__1" value="0x1" description="FLDO GOOD"/></bitfield><bitfield id="VREFSTAT" description="PSS VREF stable status" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="VREFSTAT__0" value="0x0" description="Flash LDO not stable"/><bitenum id="VREFSTAT__1" value="0x1" description="Flash LDO stable"/></bitfield><bitfield id="IREFSTAT" description="PSS IREF stable status" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="IREFSTAT__0" value="0x0" description="IREF not stable"/><bitenum id="IREFSTAT__1" value="0x1" description="IREF stable"/></bitfield><bitfield id="TRIMSTAT" description="PSS trim done status" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="TRIMSTAT__0" value="0x0" description="PSS trim not complete"/><bitenum id="TRIMSTAT__1" value="0x1" description="PSS trim complete"/></bitfield><bitfield id="RD_2T" description="Indicates if Flash is being accessed in 2T mode" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="RD_2T__0" value="0x0" description="Flash reads are in 1T mode"/><bitenum id="RD_2T__1" value="0x1" description="Flash reads are in 2T mode"/></bitfield></register><register id="TRIMCFG_CTL" width="32" offset="0x0" internal="0" description="Trim Configuration Control Register"><bitfield id="TRIM_EN_0" description="Controls the TRIMCFG_EN input of Bank0" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="RED_EN_0" description="Controls the REDUNDANCY_EN bit of the TRIMCFG bus for Bank0 (bi" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="TRIM_EN_1" description="Controls the TRIMCFG_EN input of Bank1" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="RED_EN_1" description="Controls the REDUNDANCY_EN bit of the TRIMCFG bus for Bank1 (bi" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="RED_COL_BNK0" description="Controls the REDUNDANCY_COLUMN bits of the TRIMCFG bus for Bank" begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="RED_COL_BNK1" description="Controls the REDUNDANCY_COLUMN bits of Bank1 (bits[7:0] of trim" begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="TRIMCFG0" width="32" offset="0x4" internal="0" description="Trim Configuration 0 Register"><bitfield id="PRGTRIM" description="Controls the Program Current Trim bits of the IPs (connected to" begin="2" end="0" width="3" rwaccess="R/W"/><bitfield id="EVTRIM" description="Controls the EV Temp Controlled Current Trim bits of the IPs (c" begin="6" end="3" width="4" rwaccess="R/W"/><bitfield id="SALD_TRIM" description="Controls the Sense Amp Latch Delay Trim bits of the IPs (connec" begin="9" end="7" width="3" rwaccess="R/W"/><bitfield id="SAPR_DLY" description="Controls the Sense Amp Precharge delay bits of the IPs (connect" begin="11" end="10" width="2" rwaccess="R/W"/><bitfield id="ENWRD_DLY" description="Controls the Enable Wordline delay bits of the IPs (connected t" begin="13" end="12" width="2" rwaccess="R/W"/><bitfield id="SPARETRIM_RT" description="Controls the Unused trim bits on the right side of the IPs (con" begin="15" end="14" width="2" rwaccess="R/W"/><bitfield id="PDIODE_TEST" description="Controls the 0" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="SPARETRIM_LT" description="Controls the Unused trim bits on the left side of the IPs (conn" begin="18" end="17" width="2" rwaccess="R/W"/></register><register id="TRIMCFG1" width="32" offset="0x8" internal="0" description="Trim Configuration 1 Register"><bitfield id="READ_CT" description="Controls the READ_CT bits of the IPs (connected to bits [16:9] " begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="PRGVER_CT" description="Controls the PRGVER_CT bits of the IPs (connected to bits [24:1" begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="ERSVER_CT" description="Controls the ERSVER_CT bits of the IPs (connected to bits [32:2" begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="LKGVER_CT" description="Controls the LKGVER_CT bits of the IPs (connected to bits [40:3" begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="TRIMCFG2" width="32" offset="0xC" internal="0" description="Trim Configuration 2 Register"><bitfield id="RDMRG0_CT" description="Controls the RDMRG0_CT bits of the IPs (connected to bits [48:4" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="RDMRG1_CT" description="Controls the RDMRG1_CT bits of the IPs (connected to bits [56:4" begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="RDMRG0B_CT" description="Controls the RDMRG0B_CT bits of the IPs (connected to bits [64:" begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="RDMRG1B_CT" description="Controls the RDMRG1B_CT bits of the IPs (connected to bits [72:" begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="BANK0_RDCTL" width="32" offset="0x10" internal="0" description="Bank0 Read Control Register"><bitfield id="RD_MODE" description="Flash read mode control setting for Bank 0" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="RD_MODE__0" value="0x0" description="Normal read mode"/><bitenum id="RD_MODE__1" value="0x1" description="Read Margin 0"/><bitenum id="RD_MODE__2" value="0x2" description="Read Margin 1"/><bitenum id="RD_MODE__3" value="0x3" description="Program Verify"/><bitenum id="RD_MODE__4" value="0x4" description="Erase Verify"/><bitenum id="RD_MODE__5" value="0x5" description="Leakage Verify"/><bitenum id="RD_MODE__9" value="0x9" description="Read Margin 0B"/><bitenum id="RD_MODE__10" value="0xA" description="Read Margin 1B"/></bitfield><bitfield id="BUFI" description="Enables read buffering feature for instruction fetches to this " begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="BUFD" description="Enables read buffering feature for data reads to this Bank" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="WAIT" description="Defines the number of wait states required for a read operation" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="WAIT__0" value="0" description="0 wait states"/><bitenum id="WAIT__1" value="1" description="1 wait states"/><bitenum id="WAIT__2" value="2" description="2 wait states"/><bitenum id="WAIT__3" value="3" description="3 wait states"/><bitenum id="WAIT__4" value="4" description="4 wait states"/><bitenum id="WAIT__5" value="5" description="5 wait states"/><bitenum id="WAIT__6" value="6" description="6 wait states"/><bitenum id="WAIT__7" value="7" description="7 wait states"/><bitenum id="WAIT__8" value="8" description="8 wait states"/><bitenum id="WAIT__9" value="9" description="9 wait states"/><bitenum id="WAIT__16" value="10" description="10 wait states"/><bitenum id="WAIT__17" value="11" description="11 wait states"/><bitenum id="WAIT__18" value="12" description="12 wait states"/><bitenum id="WAIT__19" value="13" description="13 wait states"/><bitenum id="WAIT__20" value="14" description="14 wait states"/><bitenum id="WAIT__21" value="15" description="15 wait states"/></bitfield><bitfield id="RD_MODE_STATUS" description="Reflects the current Read Mode of the Bank 1001 = Read Margin 0" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="RD_MODE_STATUS__0" value="0x0" description="Normal read mode"/><bitenum id="RD_MODE_STATUS__1" value="0x1" description="Read Margin 0"/><bitenum id="RD_MODE_STATUS__2" value="0x2" description="Read Margin 1"/><bitenum id="RD_MODE_STATUS__3" value="0x3" description="Program Verify"/><bitenum id="RD_MODE_STATUS__4" value="0x4" description="Erase Verify"/><bitenum id="RD_MODE_STATUS__5" value="0x5" description="Leakage Verify"/><bitenum id="RD_MODE_STATUS__9" value="0x9" description="Read Margin 0B"/><bitenum id="RD_MODE_STATUS__10" value="0xA" description="Read Margin 1B"/></bitfield></register><register id="PTRIMCFG0" width="32" offset="0x10" internal="0" description="Flash Pump Trim Configuration 0 Register"><bitfield id="PRG_VHVCT" description="Controls the VHV_CT bits of the Pump when IP is in program mode" begin="9" end="0" width="10" rwaccess="R/W"/><bitfield id="PRGVER_VHVCT" description="Controls the VHV_CT bits of the Pump when IP is in Program Veri" begin="19" end="10" width="10" rwaccess="R/W"/><bitfield id="ERS_VHVCT" description="Controls the VHV_CT bits of the Pump when IP is in Erase mode" begin="29" end="20" width="10" rwaccess="R/W"/></register><register id="BANK1_RDCTL" width="32" offset="0x14" internal="0" description="Bank1 Read Control Register"><bitfield id="RD_MODE" description="Flash read mode control setting for Bank 0" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="RD_MODE__0" value="0x0" description="Normal read mode"/><bitenum id="RD_MODE__1" value="0x1" description="Read Margin 0"/><bitenum id="RD_MODE__2" value="0x2" description="Read Margin 1"/><bitenum id="RD_MODE__3" value="0x3" description="Program Verify"/><bitenum id="RD_MODE__4" value="0x4" description="Erase Verify"/><bitenum id="RD_MODE__5" value="0x5" description="Leakage Verify"/><bitenum id="RD_MODE__9" value="0x9" description="Read Margin 0B"/><bitenum id="RD_MODE__10" value="0xA" description="Read Margin 1B"/></bitfield><bitfield id="BUFI" description="Enables read buffering feature for instruction fetches to this " begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="BUFD" description="Enables read buffering feature for data reads to this Bank" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="WAIT" description="Defines the number of wait states required for a read operation" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="WAIT__0" value="0" description="0 wait states"/><bitenum id="WAIT__1" value="1" description="1 wait states"/><bitenum id="WAIT__2" value="2" description="2 wait states"/><bitenum id="WAIT__3" value="3" description="3 wait states"/><bitenum id="WAIT__4" value="4" description="4 wait states"/><bitenum id="WAIT__5" value="5" description="5 wait states"/><bitenum id="WAIT__6" value="6" description="6 wait states"/><bitenum id="WAIT__7" value="7" description="7 wait states"/><bitenum id="WAIT__8" value="8" description="8 wait states"/><bitenum id="WAIT__9" value="9" description="9 wait states"/><bitenum id="WAIT__16" value="10" description="10 wait states"/><bitenum id="WAIT__17" value="11" description="11 wait states"/><bitenum id="WAIT__18" value="12" description="12 wait states"/><bitenum id="WAIT__19" value="13" description="13 wait states"/><bitenum id="WAIT__20" value="14" description="14 wait states"/><bitenum id="WAIT__21" value="15" description="15 wait states"/></bitfield><bitfield id="RD_MODE_STATUS" description="Reflects the current Read Mode of the Bank 1001 = Read Margin 0" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="RD_MODE_STATUS__0" value="0x0" description="Normal read mode"/><bitenum id="RD_MODE_STATUS__1" value="0x1" description="Read Margin 0"/><bitenum id="RD_MODE_STATUS__2" value="0x2" description="Read Margin 1"/><bitenum id="RD_MODE_STATUS__3" value="0x3" description="Program Verify"/><bitenum id="RD_MODE_STATUS__4" value="0x4" description="Erase Verify"/><bitenum id="RD_MODE_STATUS__5" value="0x5" description="Leakage Verify"/><bitenum id="RD_MODE_STATUS__9" value="0x9" description="Read Margin 0B"/><bitenum id="RD_MODE_STATUS__10" value="0xA" description="Read Margin 1B"/></bitfield></register><register id="PTRIMCFG1" width="32" offset="0x14" internal="0" description="Flash Pump Trim Configuration 1 Register"><bitfield id="VWLCT" description="Controls the VWLCT bits of the Pump" begin="5" end="0" width="6" rwaccess="R/W"/><bitfield id="VSLCT" description="Controls the VSLCT bits of the Pump" begin="13" end="8" width="6" rwaccess="R/W"/><bitfield id="VINHCT" description="Controls the VINHCT bits of the Pump" begin="21" end="16" width="6" rwaccess="R/W"/><bitfield id="FOSCCT" description="Controls the FOSCT bits of the Pump" begin="27" end="22" width="6" rwaccess="R/W"/><bitfield id="IREFCT" description="Controls the IREFCT bits of the Pump" begin="31" end="28" width="4" rwaccess="R/W"/></register><register id="BANK1_TRIMCFG0" width="32" offset="0x18" internal="0" description="Bank1 Trim Configuration 0 Register"><bitfield id="ERSVER_CT" description="Controls Erase Verify Reference Current Trim Value for Bank-1 (" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="EVVCR_CT" description="Controls Voltage controlled current reference trim (erase verif" begin="11" end="8" width="4" rwaccess="R/W"/><bitfield id="EVTCR_CT" description="Controls Temperature controlled current reference trim (erase v" begin="15" end="12" width="4" rwaccess="R/W"/></register><register id="RDBRST_CTLSTAT" width="32" offset="0x20" internal="0" description="Read Burst/Compare Control and Status Register"><bitfield id="START" description="Write 1 triggers start of burst/compare operation" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="MEM_TYPE" description="Type of memory that burst is carried out on" begin="2" end="1" width="2" rwaccess="R/W"><bitenum id="MEM_TYPE__0" value="0x0" description="Main Memory"/><bitenum id="MEM_TYPE__1" value="0x1" description="Information Memory"/><bitenum id="MEM_TYPE__2" value="0x2" description="Reserved"/><bitenum id="MEM_TYPE__3" value="0x3" description="Engineering Memory"/></bitfield><bitfield id="STOP_FAIL" description="If set to 1, causes burst/compare operation to terminate on fir" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="DATA_CMP" description="Data pattern used for comparison against memory read data" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="DATA_CMP__0" value="0x0" description="0000_0000_0000_0000_0000_0000_0000_0000"/><bitenum id="DATA_CMP__1" value="0x1" description="FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF"/></bitfield><bitfield id="TEST_EN" description="When set to 1, enables comparison against test data compare reg" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="BRST_STAT" description="Status of Burst/Compare operation" begin="17" end="16" width="2" rwaccess="R/W"><bitenum id="BRST_STAT__0" value="0x0" description="Idle"/><bitenum id="BRST_STAT__1" value="0x1" description="Burst/Compare START bit written, but operation pending"/><bitenum id="BRST_STAT__2" value="0x2" description="Burst/Compare in progress"/><bitenum id="BRST_STAT__3" value="0x3" description="Burst complete (status of completed burst remains in this state"/></bitfield><bitfield id="CMP_ERR" description="if 1, indicates that the Burst/Compare Operation encountered at" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="ADDR_ERR" description="If 1, indicates that Burst/Compare Operation was terminated due" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="CLR_STAT" description="Write '1' to clear status bits 19-16 of this register" begin="23" end="23" width="1" rwaccess="R/W"/></register><register id="BANK0_MSTENGR_WEPROT" width="32" offset="0x20" internal="0" description="Bank0 Engineering Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/></register><register id="RDBRST_STARTADDR" width="32" offset="0x24" internal="0" description="Read Burst/Compare Start Address Register"><bitfield id="START_ADDRESS" description="Start Address of Burst Operation" begin="20" end="0" width="21" rwaccess="R/W"/></register><register id="BANK0_MSTINFO_WEPROT" width="32" offset="0x24" internal="0" description="Bank0 Information Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/></register><register id="RDBRST_LEN" width="32" offset="0x28" internal="0" description="Read Burst/Compare Length Register"><bitfield id="BURST_LENGTH" description="Length of Burst Operation (in bytes)" begin="20" end="0" width="21" rwaccess="R/W"/></register><register id="BANK0_MSTMAIN_WEPROT" width="32" offset="0x28" internal="0" description="Bank0 Main Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PROT4" description="If set to 1, protects Sector 4 from program or erase operations" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="PROT5" description="If set to 1, protects Sector 5 from program or erase operations" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="PROT6" description="If set to 1, protects Sector 6 from program or erase operations" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="PROT7" description="If set to 1, protects Sector 7 from program or erase operations" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="PROT8" description="If set to 1, protects Sector 8 from program or erase operations" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PROT9" description="If set to 1, protects Sector 9 from program or erase operations" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="PROT10" description="If set to 1, protects Sector 10 from program or erase operations" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="PROT11" description="If set to 1, protects Sector 11 from program or erase operations" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="PROT12" description="If set to 1, protects Sector 12 from program or erase operations" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="PROT13" description="If set to 1, protects Sector 13 from program or erase operations" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="PROT14" description="If set to 1, protects Sector 14 from program or erase operations" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="PROT15" description="If set to 1, protects Sector 15 from program or erase operations" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="PROT16" description="If set to 1, protects Sector 16 from program or erase operations" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="PROT17" description="If set to 1, protects Sector 17 from program or erase operations" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="PROT18" description="If set to 1, protects Sector 18 from program or erase operations" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="PROT19" description="If set to 1, protects Sector 19 from program or erase operations" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="PROT20" description="If set to 1, protects Sector 20 from program or erase operations" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="PROT21" description="If set to 1, protects Sector 21 from program or erase operations" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="PROT22" description="If set to 1, protects Sector 22 from program or erase operations" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="PROT23" description="If set to 1, protects Sector 23 from program or erase operations" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="PROT24" description="If set to 1, protects Sector 24 from program or erase operations" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="PROT25" description="If set to 1, protects Sector 25 from program or erase operations" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="PROT26" description="If set to 1, protects Sector 26 from program or erase operations" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="PROT27" description="If set to 1, protects Sector 27 from program or erase operations" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="PROT28" description="If set to 1, protects Sector 28 from program or erase operations" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="PROT29" description="If set to 1, protects Sector 29 from program or erase operations" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="PROT30" description="If set to 1, protects Sector 30 from program or erase operations" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="PROT31" description="If set to 1, protects Sector 31 from program or erase operations" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="BANK1_MSTENGR_WEPROT" width="32" offset="0x30" internal="0" description="Bank1 Engineering Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/></register><register id="BANK1_MSTINFO_WEPROT" width="32" offset="0x34" internal="0" description="Bank1 Information Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/></register><register id="BANK1_MSTMAIN_WEPROT" width="32" offset="0x38" internal="0" description="Bank1 Main Memory Master Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operat