ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/flctl.xml
ions" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PROT4" description="If set to 1, protects Sector 4 from program or erase operations" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="PROT5" description="If set to 1, protects Sector 5 from program or erase operations" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="PROT6" description="If set to 1, protects Sector 6 from program or erase operations" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="PROT7" description="If set to 1, protects Sector 7 from program or erase operations" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="PROT8" description="If set to 1, protects Sector 8 from program or erase operations" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PROT9" description="If set to 1, protects Sector 9 from program or erase operations" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="PROT10" description="If set to 1, protects Sector 10 from program or erase operations" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="PROT11" description="If set to 1, protects Sector 11 from program or erase operations" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="PROT12" description="If set to 1, protects Sector 12 from program or erase operations" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="PROT13" description="If set to 1, protects Sector 13 from program or erase operations" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="PROT14" description="If set to 1, protects Sector 14 from program or erase operations" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="PROT15" description="If set to 1, protects Sector 15 from program or erase operations" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="PROT16" description="If set to 1, protects Sector 16 from program or erase operations" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="PROT17" description="If set to 1, protects Sector 17 from program or erase operations" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="PROT18" description="If set to 1, protects Sector 18 from program or erase operations" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="PROT19" description="If set to 1, protects Sector 19 from program or erase operations" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="PROT20" description="If set to 1, protects Sector 20 from program or erase operations" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="PROT21" description="If set to 1, protects Sector 21 from program or erase operations" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="PROT22" description="If set to 1, protects Sector 22 from program or erase operations" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="PROT23" description="If set to 1, protects Sector 23 from program or erase operations" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="PROT24" description="If set to 1, protects Sector 24 from program or erase operations" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="PROT25" description="If set to 1, protects Sector 25 from program or erase operations" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="PROT26" description="If set to 1, protects Sector 26 from program or erase operations" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="PROT27" description="If set to 1, protects Sector 27 from program or erase operations" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="PROT28" description="If set to 1, protects Sector 28 from program or erase operations" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="PROT29" description="If set to 1, protects Sector 29 from program or erase operations" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="PROT30" description="If set to 1, protects Sector 30 from program or erase operations" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="PROT31" description="If set to 1, protects Sector 31 from program or erase operations" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="RDBRST_FAILADDR" width="32" offset="0x3C" internal="0" description="Read Burst/Compare Fail Address Register"><bitfield id="FAIL_ADDRESS" description="Reflects address of last failed compare" begin="20" end="0" width="21" rwaccess="R/W"/></register><register id="RDBRST_FAILCNT" width="32" offset="0x40" internal="0" description="Read Burst/Compare Fail Count Register"><bitfield id="FAIL_COUNT" description="Reflects number of failures encountered in burst operation." begin="16" end="0" width="17" rwaccess="R/W"/></register><register id="PRG_CTLSTAT" width="32" offset="0x50" internal="0" description="Program Control and Status Register"><bitfield id="ENABLE" description="Master control for all word program operations" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="Word program operation disabled"/><bitenum id="ENABLE__1" value="0x1" description="Word program operation enabled"/></bitfield><bitfield id="MODE" description="Controls write mode selected by application" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="MODE__0" value="0x0" description="Write immediate mode"/><bitenum id="MODE__1" value="0x1" description="Full word write mode"/></bitfield><bitfield id="VER_PRE" description="Controls automatic pre program verify operations" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="VER_PRE__0" value="0x0" description="No pre program verification"/><bitenum id="VER_PRE__1" value="0x1" description="Pre verify feature automatically invoked for each write operati"/></bitfield><bitfield id="VER_PST" description="Controls automatic post program verify operations" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="VER_PST__0" value="0x0" description="No post program verification"/><bitenum id="VER_PST__1" value="0x1" description="Post verify feature automatically invoked for each write operat"/></bitfield><bitfield id="STATUS" description="Reflects the status of program operations in the Flash memory" begin="17" end="16" width="2" rwaccess="R/W"><bitenum id="STATUS__0" value="0x0" description="Idle (no program operation currently active)"/><bitenum id="STATUS__1" value="0x1" description="Single word program operation triggered, but pending"/><bitenum id="STATUS__2" value="0x2" description="Single word program in progress"/><bitenum id="STATUS__3" value="0x3" description="Reserved (Idle)"/></bitfield><bitfield id="BNK_ACT" description="Reflects which bank is currently undergoing a program operation" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="BNK_ACT__0" value="0x0" description="Word in Bank0 being programmed"/><bitenum id="BNK_ACT__1" value="0x1" description="Word in Bank1 being programmed"/></bitfield></register><register id="PRGBRST_CTLSTAT" width="32" offset="0x54" internal="0" description="Program Burst Control and Status Register"><bitfield id="START" description="Write 1 triggers start of burst program operation" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="TYPE" description="Type of memory that burst program is carried out on" begin="2" end="1" width="2" rwaccess="R/W"><bitenum id="TYPE__0" value="0x0" description="Main Memory"/><bitenum id="TYPE__1" value="0x1" description="Information Memory"/><bitenum id="TYPE__2" value="0x2" description="Reserved"/><bitenum id="TYPE__3" value="0x3" description="Engineering Memory"/></bitfield><bitfield id="LEN" description="Length of burst (in 128 bit granularity)" begin="5" end="3" width="3" rwaccess="R/W"><bitenum id="LEN__0" value="0x0" description="No burst operation"/><bitenum id="LEN__1" value="0x1" description="1 word burst of 128 bits, starting with address in the FLCTL_PR"/><bitenum id="LEN__2" value="0x2" description="2*128 bits burst write, starting with address in the FLCTL_PRGB"/><bitenum id="LEN__3" value="0x3" description="3*128 bits burst write, starting with address in the FLCTL_PRGB"/><bitenum id="LEN__4" value="0x4" description="4*128 bits burst write, starting with address in the FLCTL_PRGB"/></bitfield><bitfield id="AUTO_PRE" description="Controls the Auto-Verify operation before the Burst Program" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="AUTO_PRE__0" value="0x0" description="No program verify operations carried out"/><bitenum id="AUTO_PRE__1" value="0x1" description="Causes an automatic Burst Program Verify after the Burst Progra"/></bitfield><bitfield id="AUTO_PST" description="Controls the Auto-Verify operation after the Burst Program" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="AUTO_PST__0" value="0x0" description="No program verify operations carried out"/><bitenum id="AUTO_PST__1" value="0x1" description="Causes an automatic Burst Program Verify before the Burst Progr"/></bitfield><bitfield id="BURST_STATUS" description="At any point in time, it reflects the status of a Burst Operati" begin="18" end="16" width="3" rwaccess="R/W"><bitenum id="BURST_STATUS__0" value="0x0" description="Idle (Burst not active)"/><bitenum id="BURST_STATUS__1" value="0x1" description="Burst program started but pending"/><bitenum id="BURST_STATUS__2" value="0x2" description="Burst active, with 1st 128 bit word being written into Flash"/><bitenum id="BURST_STATUS__3" value="0x3" description="Burst active, with 2nd 128 bit word being written into Flash"/><bitenum id="BURST_STATUS__4" value="0x4" description="Burst active, with 3rd 128 bit word being written into Flash"/><bitenum id="BURST_STATUS__5" value="0x5" description="Burst active, with 4th 128 bit word being written into Flash"/><bitenum id="BURST_STATUS__6" value="0x6" description="Reserved (Idle)"/><bitenum id="BURST_STATUS__7" value="0x7" description="Burst Complete (status of completed burst remains in this state"/></bitfield><bitfield id="PRE_ERR" description="If 1, indicates that Burst Operation encountered preprogram aut" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="PST_ERR" description="if 1, indicates that the Burst Operation encountered postprogra" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="ADDR_ERR" description="If 1, indicates that Burst Operation was terminated due to atte" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="CLR_STAT" description="Write '1' to clear status bits 21-16 of this register&#13;&#10;Write '0" begin="23" end="23" width="1" rwaccess="R/W"/></register><register id="PRGBRST_STARTADDR" width="32" offset="0x58" internal="0" description="Program Burst Start Address Register"><bitfield id="START_ADDRESS" description="Start Address of Program Burst Operation" begin="21" end="0" width="22" rwaccess="R/W"/></register><register id="PRGBRST_DATA0_0" width="32" offset="0x60" internal="0" description="Program Burst Data0 Register0"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 0 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA0_1" width="32" offset="0x64" internal="0" description="Program Burst Data0 Register1"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 0 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA0_2" width="32" offset="0x68" internal="0" description="Program Burst Data0 Register2"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 0 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA0_3" width="32" offset="0x6C" internal="0" description="Program Burst Data0 Register3"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 0 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA1_0" width="32" offset="0x70" internal="0" description="Program Burst Data1 Register0"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 1 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA1_1" width="32" offset="0x74" internal="0" description="Program Burst Data1 Register1"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 1 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA1_2" width="32" offset="0x78" internal="0" description="Program Burst Data1 Register2"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 1 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA1_3" width="32" offset="0x7C" internal="0" description="Program Burst Data1 Register3"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 1 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA2_0" width="32" offset="0x80" internal="0" description="Program Burst Data2 Register0"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 2 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA2_1" width="32" offset="0x84" internal="0" description="Program Burst Data2 Register1"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 2 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA2_2" width="32" offset="0x88" internal="0" description="Program Burst Data2 Register2"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 2 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA2_3" width="32" offset="0x8C" internal="0" description="Program Burst Data2 Register3"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 2 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA3_0" width="32" offset="0x90" internal="0" description="Program Burst Data3 Register0"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 3 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA3_1" width="32" offset="0x94" internal="0" description="Program Burst Data3 Register1"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 3 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA3_2" width="32" offset="0x98" internal="0" description="Program Burst Data3 Register2"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 3 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PRGBRST_DATA3_3" width="32" offset="0x9C" internal="0" description="Program Burst Data3 Register3"><bitfield id="DATAIN" description="Program Burst 128 bit Data Word 3 (bits (32*(x+1)-1) downto 32*" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="ERASE_CTLSTAT" width="32" offset="0xA0" internal="0" description="Erase Control and Status Register"><bitfield id="START" description="Write 1 triggers start of Erase operation" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="MODE" description="Controls erase mode selected by application" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="MODE__0" value="0x0" description="Sector Erase (controlled by FLTCTL_ERASE_SECTADDR)"/><bitenum id="MODE__1" value="0x1" description="Mass Erase (includes all Main and Information memory sectors th"/></bitfield><bitfield id="TYPE" description="Type of memory that erase operation is carried out on (don't ca" begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="TYPE__0" value="0x0" description="Main Memory"/><bitenum id="TYPE__1" value="0x1" description="Information Memory"/><bitenum id="TYPE__2" value="0x2" description="Reserved"/><bitenum id="TYPE__3" value="0x3" description="Engineering Memory"/></bitfield><bitfield id="STATUS" description="Reflects the status of erase operations in the Flash memory" begin="17" end="16" width="2" rwaccess="R/W"><bitenum id="STATUS__0" value="0x0" description="Idle (no program operation currently active)"/><bitenum id="STATUS__1" value="0x1" description="Erase operation triggered to START but pending"/><bitenum id="STATUS__2" value="0x2" description="Erase operation in progress"/><bitenum id="STATUS__3" value="0x3" description="Erase operation completed (status of completed erase remains in"/></bitfield><bitfield id="ADDR_ERR" description="If 1, indicates that Erase Operation was terminated due to atte" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="CLR_STAT" description="Write '1' to clear status bits 18-16 of this register&#13;&#10;Write '0" begin="19" end="19" width="1" rwaccess="R/W"/></register><register id="ERASE_SECTADDR" width="32" offset="0xA4" internal="0" description="Erase Sector Address Register"><bitfield id="SECT_ADDRESS" description="Address of Sector being Erased" begin="21" end="0" width="22" rwaccess="R/W"/></register><register id="BANK0_INFO_WEPROT" width="32" offset="0xB0" internal="0" description="Information Memory Bank0 Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/></register><register id="BANK0_MAIN_WEPROT" width="32" offset="0xB4" internal="0" description="Main Memory Bank0 Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PROT4" description="If set to 1, protects Sector 4 from program or erase operations" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="PROT5" description="If set to 1, protects Sector 5 from program or erase operations" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="PROT6" description="If set to 1, protects Sector 6 from program or erase operations" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="PROT7" description="If set to 1, protects Sector 7 from program or erase operations" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="PROT8" description="If set to 1, protects Sector 8 from program or erase operations" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PROT9" description="If set to 1, protects Sector 9 from program or erase operations" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="PROT10" description="If set to 1, protects Sector 10 from program or erase operations" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="PROT11" description="If set to 1, protects Sector 11 from program or erase operations" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="PROT12" description="If set to 1, protects Sector 12 from program or erase operations" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="PROT13" description="If set to 1, protects Sector 13 from program or erase operations" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="PROT14" description="If set to 1, protects Sector 14 from program or erase operations" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="PROT15" description="If set to 1, protects Sector 15 from program or erase operations" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="PROT16" description="If set to 1, protects Sector 16 from program or erase operations" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="PROT17" description="If set to 1, protects Sector 17 from program or erase operations" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="PROT18" description="If set to 1, protects Sector 18 from program or erase operations" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="PROT19" description="If set to 1, protects Sector 19 from program or erase operations" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="PROT20" description="If set to 1, protects Sector 20 from program or erase operations" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="PROT21" description="If set to 1, protects Sector 21 from program or erase operations" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="PROT22" description="If set to 1, protects Sector 22 from program or erase operations" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="PROT23" description="If set to 1, protects Sector 23 from program or erase operations" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="PROT24" description="If set to 1, protects Sector 24 from program or erase operations" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="PROT25" description="If set to 1, protects Sector 25 from program or erase operations" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="PROT26" description="If set to 1, protects Sector 26 from program or erase operations" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="PROT27" description="If set to 1, protects Sector 27 from program or erase operations" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="PROT28" description="If set to 1, protects Sector 28 from program or erase operations" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="PROT29" description="If set to 1, protects Sector 29 from program or erase operations" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="PROT30" description="If set to 1, protects Sector 30 from program or erase operations" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="PROT31" description="If set to 1, protects Sector 31 from program or erase operations" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="BANK1_INFO_WEPROT" width="32" offset="0xC0" internal="0" description="Information Memory Bank1 Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/></register><register id="BANK1_MAIN_WEPROT" width="32" offset="0xC4" internal="0" description="Main Memory Bank1 Write/Erase Protection Register"><bitfield id="PROT0" description="If set to 1, protects Sector 0 from program or erase operations" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="PROT1" description="If set to 1, protects Sector 1 from program or erase operations" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PROT2" description="If set to 1, protects Sector 2 from program or erase operations" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PROT3" description="If set to 1, protects Sector 3 from program or erase operations" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PROT4" description="If set to 1, protects Sector 4 from program or erase operations" begin="4" end="4" width="1" rwa