ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/flctl.xml
ccess="R/W"/><bitfield id="PROT5" description="If set to 1, protects Sector 5 from program or erase operations" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="PROT6" description="If set to 1, protects Sector 6 from program or erase operations" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="PROT7" description="If set to 1, protects Sector 7 from program or erase operations" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="PROT8" description="If set to 1, protects Sector 8 from program or erase operations" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PROT9" description="If set to 1, protects Sector 9 from program or erase operations" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="PROT10" description="If set to 1, protects Sector 10 from program or erase operations" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="PROT11" description="If set to 1, protects Sector 11 from program or erase operations" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="PROT12" description="If set to 1, protects Sector 12 from program or erase operations" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="PROT13" description="If set to 1, protects Sector 13 from program or erase operations" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="PROT14" description="If set to 1, protects Sector 14 from program or erase operations" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="PROT15" description="If set to 1, protects Sector 15 from program or erase operations" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="PROT16" description="If set to 1, protects Sector 16 from program or erase operations" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="PROT17" description="If set to 1, protects Sector 17 from program or erase operations" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="PROT18" description="If set to 1, protects Sector 18 from program or erase operations" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="PROT19" description="If set to 1, protects Sector 19 from program or erase operations" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="PROT20" description="If set to 1, protects Sector 20 from program or erase operations" begin="20" end="20" width="1" rwaccess="R/W"/><bitfield id="PROT21" description="If set to 1, protects Sector 21 from program or erase operations" begin="21" end="21" width="1" rwaccess="R/W"/><bitfield id="PROT22" description="If set to 1, protects Sector 22 from program or erase operations" begin="22" end="22" width="1" rwaccess="R/W"/><bitfield id="PROT23" description="If set to 1, protects Sector 23 from program or erase operations" begin="23" end="23" width="1" rwaccess="R/W"/><bitfield id="PROT24" description="If set to 1, protects Sector 24 from program or erase operations" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="PROT25" description="If set to 1, protects Sector 25 from program or erase operations" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="PROT26" description="If set to 1, protects Sector 26 from program or erase operations" begin="26" end="26" width="1" rwaccess="R/W"/><bitfield id="PROT27" description="If set to 1, protects Sector 27 from program or erase operations" begin="27" end="27" width="1" rwaccess="R/W"/><bitfield id="PROT28" description="If set to 1, protects Sector 28 from program or erase operations" begin="28" end="28" width="1" rwaccess="R/W"/><bitfield id="PROT29" description="If set to 1, protects Sector 29 from program or erase operations" begin="29" end="29" width="1" rwaccess="R/W"/><bitfield id="PROT30" description="If set to 1, protects Sector 30 from program or erase operations" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="PROT31" description="If set to 1, protects Sector 31 from program or erase operations" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="BMRK_CTLSTAT" width="32" offset="0xD0" internal="0" description="Benchmark Control and Status Register"><bitfield id="I_BMRK" description="When 1, increments the Instruction Benchmark count register on " begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="D_BMRK" description="When 1, increments the Data Benchmark count register on each da" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="CMP_EN" description="When 1, enables comparison of the Instruction or Data Benchmark" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="CMP_SEL" description="Selects which benchmark register should be compared against the" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="CMP_SEL__0" value="0x0" description="Compares the Instruction Benchmark Register against the thresho"/><bitenum id="CMP_SEL__1" value="0x1" description="Compares the Data Benchmark Register against the threshold value"/></bitfield></register><register id="BMRK_IFETCH" width="32" offset="0xD4" internal="0" description="Benchmark Instruction Fetch Count Register"><bitfield id="COUNT" description="Reflects the number of Instruction Fetches to the Flash (increm" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="BMRK_DREAD" width="32" offset="0xD8" internal="0" description="Benchmark Data Read Count Register"><bitfield id="COUNT" description="Reflects the number of Data Read operations to the Flash (incre" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="BMRK_CMP" width="32" offset="0xDC" internal="0" description="Benchmark Count Compare Register"><bitfield id="COUNT" description="Reflects the threshold value that is compared against either th" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="IFG" width="32" offset="0xF0" internal="0" description="Interrupt Flag Register"><bitfield id="RDBRST" description="If set to 1, indicates that the Read Burst/Compare operation is" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="AVPRE" description="If set to 1, indicates that the pre-program verify operation ha" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="AVPST" description="If set to 1, indicates that the post-program verify operation h" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PRG" description="If set to 1, indicates that a word Program operation is complete" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PRGB" description="If set to 1, indicates that the configured Burst Program operat" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="ERASE" description="If set to 1, indicates that the Erase operation is complete" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="BMRK" description="If set to 1, indicates that a Benchmark Compare match occurred" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PRG_ERR" description="If set to 1, indicates a word composition error in full word wr" begin="9" end="9" width="1" rwaccess="R/W"/></register><register id="IE" width="32" offset="0xF4" internal="0" description="Interrupt Enable Register"><bitfield id="RDBRST" description="If set to 1, enables the Controller to generate an interrupt ba" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="AVPRE" description="If set to 1, enables the Controller to generate an interrupt ba" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="AVPST" description="If set to 1, enables the Controller to generate an interrupt ba" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PRG" description="If set to 1, enables the Controller to generate an interrupt ba" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PRGB" description="If set to 1, enables the Controller to generate an interrupt ba" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="ERASE" description="If set to 1, enables the Controller to generate an interrupt ba" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="BMRK" description="If set to 1, enables the Controller to generate an interrupt ba" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PRG_ERR" description="If set to 1, enables the Controller to generate an interrupt ba" begin="9" end="9" width="1" rwaccess="R/W"/></register><register id="CLRIFG" width="32" offset="0xF8" internal="0" description="Clear Interrupt Flag Register"><bitfield id="RDBRST" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="AVPRE" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="AVPST" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PRG" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PRGB" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="ERASE" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="BMRK" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PRG_ERR" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="9" end="9" width="1" rwaccess="R/W"/></register><register id="SETIFG" width="32" offset="0xFC" internal="0" description="Set Interrupt Flag Register"><bitfield id="RDBRST" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="AVPRE" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="AVPST" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PRG" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="PRGB" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="ERASE" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="BMRK" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PRG_ERR" description="Write 1 clears the corresponding interrupt flag bit in the FLCT" begin="9" end="9" width="1" rwaccess="R/W"/></register><register id="READ_TIMCTL" width="32" offset="0x100" internal="0" description="Read Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="11" end="8" width="4" rwaccess="R/W"/><bitfield id="IREF_BOOST1" description="Configures the length of the IREF_BOOST1 signal of the IP" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="SETUP_LONG" description="Configures the length of the Setup time into read mode when the" begin="23" end="16" width="8" rwaccess="R/W"/></register><register id="READMARGIN_TIMCTL" width="32" offset="0x104" internal="0" description="Read Margin Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="11" end="8" width="4" rwaccess="R/W"/></register><register id="PRGVER_TIMCTL" width="32" offset="0x108" internal="0" description="Program Verify Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="ACTIVE" description="Configures the length of the Active phase for this operation" begin="11" end="8" width="4" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="15" end="12" width="4" rwaccess="R/W"/></register><register id="ERSVER_TIMCTL" width="32" offset="0x10C" internal="0" description="Erase Verify Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="11" end="8" width="4" rwaccess="R/W"/></register><register id="LKGVER_TIMCTL" width="32" offset="0x110" internal="0" description="Leakage Verify Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="11" end="8" width="4" rwaccess="R/W"/></register><register id="PROGRAM_TIMCTL" width="32" offset="0x114" internal="0" description="Program Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="ACTIVE" description="Configures the length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R/W"/></register><register id="ERASE_TIMCTL" width="32" offset="0x118" internal="0" description="Erase Timing Control Register"><bitfield id="SETUP" description="Configures the length of the Setup phase for this operation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="ACTIVE" description="Configures the length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R/W"/><bitfield id="HOLD" description="Configures the length of the Hold phase for this operation" begin="31" end="28" width="4" rwaccess="R/W"/></register><register id="MASSERASE_TIMCTL" width="32" offset="0x11C" internal="0" description="Mass Erase Timing Control Register"><bitfield id="BOOST_ACTIVE" description="Configures the length of the time for which LDO Boost Signal is" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="BOOST_HOLD" description="Configures the length for which Flash deactivates the LDO Boost" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="BURSTPRG_TIMCTL" width="32" offset="0x120" internal="0" description="Burst Program Timing Control Register"><bitfield id="ACTIVE" description="Configures the length of the Active phase for this operation" begin="27" end="8" width="20" rwaccess="R/W"/></register></module>